using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Less_DB_1
{
    class text
    {
        /*База данных (БД) – совокупность взаимосвязанных, хранящихся вместе данных при наличии
         * такой минимальной избыточности, которая допускает их использование оптимальным образом для
         * одного или нескольких приложений.
         * 
         * Реляционная база данных — база данных, основанная на реляционной модели данных.
         * Понятие «реляционный» основано на англ. relation («отношение, зависимость, связь»)
         * 
         * Система управления базами данных (СУБД) – это комплекс программных и языковых средств, 
         * необходимых для создания баз данных, поддержания их
         * в актуальном состоянии и организации поиска в них необходимой информации.
         * 
         * 
         * SQL (англ. structured query language — «язык структурированных запросов») — язык
         * программирования, применяемый для создания, модификации и управления данными в реляционной базе данных,
         * управляемой соответствующей системой управления базами данных.
         * 
         * На реляционной модели данных строятся реляционные базы данных.
         * Реляционная модель данных включает следующие компоненты:
         * 
         * Структурный аспект (составляющая) — данные в базе данных представляют собой набор отношений.
         * 
         * Аспект (составляющая) целостности — отношения отвечают определённым условиям целостности.
         * РМД поддерживает декларативные ограничения целостности уровня домена (типа данных), уровня отношения
         * и уровня базы данных.
         * 
         * Аспект (составляющая) обработки (манипулирования) — РМД поддерживает операторы манипулирования 
         * отношениями (реляционная алгебра, реляционное исчисление).
         * 
         * Таблица — это совокупность связанных данных, хранящихся в структурированном виде в
         * базе данных. Она состоит из столбцов и строк.
         * 
         * 
         */
    }
}
